Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_BGCR_E_MMC_STPBGR_Pos           _U_(0)                                               /**< (SDMMC_BGCR) Stop At Block Gap Request Position */
#define SDMMC_BGCR_E_MMC_STPBGR_Msk           (_U_(0x1) << SDMMC_BGCR_E_MMC_STPBGR_Pos)            /**< (SDMMC_BGCR) Stop At Block Gap Request Mask */
#define SDMMC_BGCR_E_MMC_STPBGR(value)        (SDMMC_BGCR_E_MMC_STPBGR_Msk & ((value) << SDMMC_BGCR_E_MMC_STPBGR_Pos))
#define SDMMC_BGCR_E_MMC_CONTR_Pos            _U_(1)                                               /**< (SDMMC_BGCR) Continue Request Position */
#define SDMMC_BGCR_E_MMC_CONTR_Msk            (_U_(0x1) << SDMMC_BGCR_E_MMC_CONTR_Pos)             /**< (SDMMC_BGCR) Continue Request Mask */
#define SDMMC_BGCR_E_MMC_CONTR(value)         (SDMMC_BGCR_E_MMC_CONTR_Msk & ((value) << SDMMC_BGCR_E_MMC_CONTR_Pos))
#define SDMMC_BGCR_E_MMC_Msk                  _U_(0x03)                                             /**< (SDMMC_BGCR_E_MMC) Register Mask  */


/* -------- SDMMC_WCR : (SDMMC Offset: 0x2B) (R/W 8) Wakeup Control Register -------- */
#define SDMMC_WCR_WKENCINT_Pos                _U_(0)                                               /**< (SDMMC_WCR) Wakeup Event Enable on Card Interrupt Position */
#define SDMMC_WCR_WKENCINT_Msk                (_U_(0x1) << SDMMC_WCR_WKENCINT_Pos)                 /**< (SDMMC_WCR) Wakeup Event Enable on Card Interrupt Mask */
#define SDMMC_WCR_WKENCINT(value)             (SDMMC_WCR_WKENCINT_Msk & ((value) << SDMMC_WCR_WKENCINT_Pos))
#define   SDMMC_WCR_WKENCINT_DISABLED_Val     _U_(0x0)                                             /**< (SDMMC_WCR) Wakeup Event disabled.  */
#define   SDMMC_WCR_WKENCINT_ENABLED_Val      _U_(0x1)                                             /**< (SDMMC_WCR) Wakeup Event enabled.  */
#define SDMMC_WCR_WKENCINT_DISABLED           (SDMMC_WCR_WKENCINT_DISABLED_Val << SDMMC_WCR_WKENCINT_Pos) /**< (SDMMC_WCR) Wakeup Event disabled. Position  */
#define SDMMC_WCR_WKENCINT_ENABLED            (SDMMC_WCR_WKENCINT_ENABLED_Val << SDMMC_WCR_WKENCINT_Pos) /**< (SDMMC_WCR) Wakeup Event enabled. Position  */
#define SDMMC_WCR_WKENCINS_Pos                _U_(1)                                               /**< (SDMMC_WCR) Wakeup Event Enable on Card Insertion Position */
#define SDMMC_WCR_WKENCINS_Msk                (_U_(0x1) << SDMMC_WCR_WKENCINS_Pos)                 /**< (SDMMC_WCR) Wakeup Event Enable on Card Insertion Mask */
#define SDMMC_WCR_WKENCINS(value)             (SDMMC_WCR_WKENCINS_Msk & ((value) << SDMMC_WCR_WKENCINS_Pos))
#define   SDMMC_WCR_WKENCINS_DISABLED_Val     _U_(0x0)                                             /**< (SDMMC_WCR) Wakeup Event disabled.  */
#define   SDMMC_WCR_WKENCINS_ENABLED_Val      _U_(0x1)                                             /**< (SDMMC_WCR) Wakeup Event enabled.  */
#define SDMMC_WCR_WKENCINS_DISABLED           (SDMMC_WCR_WKENCINS_DISABLED_Val << SDMMC_WCR_WKENCINS_Pos) /**< (SDMMC_WCR) Wakeup Event disabled. Position  */
#define SDMMC_WCR_WKENCINS_ENABLED            (SDMMC_WCR_WKENCINS_ENABLED_Val << SDMMC_WCR_WKENCINS_Pos) /**< (SDMMC_WCR) Wakeup Event enabled. Position  */
#define SDMMC_WCR_WKENCREM_Pos                _U_(2)                                               /**< (SDMMC_WCR) Wakeup Event Enable on Card Removal Position */
#define SDMMC_WCR_WKENCREM_Msk                (_U_(0x1) << SDMMC_WCR_WKENCREM_Pos)                 /**< (SDMMC_WCR) Wakeup Event Enable on Card Removal Mask */
#define SDMMC_WCR_WKENCREM(value)             (SDMMC_WCR_WKENCREM_Msk & ((value) << SDMMC_WCR_WKENCREM_Pos))
#define   SDMMC_WCR_WKENCREM_DISABLED_Val     _U_(0x0)                                             /**< (SDMMC_WCR) Wakeup Event disabled.  */
#define   SDMMC_WCR_WKENCREM_ENABLED_Val      _U_(0x1)                                             /**< (SDMMC_WCR) Wakeup Event enabled.  */
#define SDMMC_WCR_WKENCREM_DISABLED           (SDMMC_WCR_WKENCREM_DISABLED_Val << SDMMC_WCR_WKENCREM_Pos) /**< (SDMMC_WCR) Wakeup Event disabled. Position  */
#define SDMMC_WCR_WKENCREM_ENABLED            (SDMMC_WCR_WKENCREM_ENABLED_Val << SDMMC_WCR_WKENCREM_Pos) /**< (SDMMC_WCR) Wakeup Event enabled. Position  */
#define SDMMC_WCR_Msk                         _U_(0x07)                                            /**< (SDMMC_WCR) Register Mask  */


/* -------- SDMMC_CCR : (SDMMC Offset: 0x2C) (R/W 16) Clock Control Register -------- */
#define SDMMC_CCR_INTCLKEN_Pos                _U_(0)                                               /**< (SDMMC_CCR) Internal Clock Enable Position */
#define SDMMC_CCR_INTCLKEN_Msk                (_U_(0x1) << SDMMC_CCR_INTCLKEN_Pos)                 /**< (SDMMC_CCR) Internal Clock Enable Mask */
#define SDMMC_CCR_INTCLKEN(value)             (SDMMC_CCR_INTCLKEN_Msk & ((value) << SDMMC_CCR_INTCLKEN_Pos))
#define SDMMC_CCR_INTCLKS_Pos                 _U_(1)                                               /**< (SDMMC_CCR) Internal Clock Stable Position */
#define SDMMC_CCR_INTCLKS_Msk                 (_U_(0x1) << SDMMC_CCR_INTCLKS_Pos)                  /**< (SDMMC_CCR) Internal Clock Stable Mask */
#define SDMMC_CCR_INTCLKS(value)              (SDMMC_CCR_INTCLKS_Msk & ((value) << SDMMC_CCR_INTCLKS_Pos))
#define SDMMC_CCR_SDCLKEN_Pos                 _U_(2)                                               /**< (SDMMC_CCR) SD Clock Enable Position */
#define SDMMC_CCR_SDCLKEN_Msk                 (_U_(0x1) << SDMMC_CCR_SDCLKEN_Pos)                  /**< (SDMMC_CCR) SD Clock Enable Mask */
#define SDMMC_CCR_SDCLKEN(value)              (SDMMC_CCR_SDCLKEN_Msk & ((value) << SDMMC_CCR_SDCLKEN_Pos))
#define SDMMC_CCR_CLKGSEL_Pos                 _U_(5)                                               /**< (SDMMC_CCR) Clock Generator Select Position */
#define SDMMC_CCR_CLKGSEL_Msk                 (_U_(0x1) << SDMMC_CCR_CLKGSEL_Pos)                  /**< (SDMMC_CCR) Clock Generator Select Mask */
#define SDMMC_CCR_CLKGSEL(value)              (SDMMC_CCR_CLKGSEL_Msk & ((value) << SDMMC_CCR_CLKGSEL_Pos))
#define SDMMC_CCR_USDCLKFSEL_Pos              _U_(6)                                               /**< (SDMMC_CCR) Upper Bits of SDCLK Frequency Select Position */
#define SDMMC_CCR_USDCLKFSEL_Msk              (_U_(0x3) << SDMMC_CCR_USDCLKFSEL_Pos)               /**< (SDMMC_CCR) Upper Bits of SDCLK Frequency Select Mask */
#define SDMMC_CCR_USDCLKFSEL(value)           (SDMMC_CCR_USDCLKFSEL_Msk & ((value) << SDMMC_CCR_USDCLKFSEL_Pos))
#define SDMMC_CCR_SDCLKFSEL_Pos               _U_(8)                                               /**< (SDMMC_CCR) SDCLK Frequency Select Position */
#define SDMMC_CCR_SDCLKFSEL_Msk               (_U_(0xFF) << SDMMC_CCR_SDCLKFSEL_Pos)               /**< (SDMMC_CCR) SDCLK Frequency Select Mask */
#define SDMMC_CCR_SDCLKFSEL(value)            (SDMMC_CCR_SDCLKFSEL_Msk & ((value) << SDMMC_CCR_SDCLKFSEL_Pos))
#define SDMMC_CCR_Msk                         _U_(0xFFE7)                                          /**< (SDMMC_CCR) Register Mask  */


