Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdmmc.h
/* E_MMC mode */
#define SDMMC_NISIER_E_MMC_CMDC_Pos           _U_(0)                                               /**< (SDMMC_NISIER) Command Complete Signal Enable Position */
#define SDMMC_NISIER_E_MMC_CMDC_Msk           (_U_(0x1) << SDMMC_NISIER_E_MMC_CMDC_Pos)            /**< (SDMMC_NISIER) Command Complete Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_CMDC(value)        (SDMMC_NISIER_E_MMC_CMDC_Msk & ((value) << SDMMC_NISIER_E_MMC_CMDC_Pos))
#define   SDMMC_NISIER_E_MMC_CMDC_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the CMDC status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_CMDC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the CMDC status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_CMDC_MASKED        (SDMMC_NISIER_E_MMC_CMDC_MASKED_Val << SDMMC_NISIER_E_MMC_CMDC_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the CMDC status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_CMDC_ENABLED       (SDMMC_NISIER_E_MMC_CMDC_ENABLED_Val << SDMMC_NISIER_E_MMC_CMDC_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the CMDC status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_TRFC_Pos           _U_(1)                                               /**< (SDMMC_NISIER) Transfer Complete Signal Enable Position */
#define SDMMC_NISIER_E_MMC_TRFC_Msk           (_U_(0x1) << SDMMC_NISIER_E_MMC_TRFC_Pos)            /**< (SDMMC_NISIER) Transfer Complete Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_TRFC(value)        (SDMMC_NISIER_E_MMC_TRFC_Msk & ((value) << SDMMC_NISIER_E_MMC_TRFC_Pos))
#define   SDMMC_NISIER_E_MMC_TRFC_MASKED_Val  _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the TRFC status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_TRFC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the TRFC status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_TRFC_MASKED        (SDMMC_NISIER_E_MMC_TRFC_MASKED_Val << SDMMC_NISIER_E_MMC_TRFC_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the TRFC status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_TRFC_ENABLED       (SDMMC_NISIER_E_MMC_TRFC_ENABLED_Val << SDMMC_NISIER_E_MMC_TRFC_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the TRFC status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BLKGE_Pos          _U_(2)                                               /**< (SDMMC_NISIER) Block Gap Event Signal Enable Position */
#define SDMMC_NISIER_E_MMC_BLKGE_Msk          (_U_(0x1) << SDMMC_NISIER_E_MMC_BLKGE_Pos)           /**< (SDMMC_NISIER) Block Gap Event Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_BLKGE(value)       (SDMMC_NISIER_E_MMC_BLKGE_Msk & ((value) << SDMMC_NISIER_E_MMC_BLKGE_Pos))
#define   SDMMC_NISIER_E_MMC_BLKGE_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the BLKGE status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_BLKGE_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the BLKGE status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_BLKGE_MASKED       (SDMMC_NISIER_E_MMC_BLKGE_MASKED_Val << SDMMC_NISIER_E_MMC_BLKGE_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the BLKGE status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BLKGE_ENABLED      (SDMMC_NISIER_E_MMC_BLKGE_ENABLED_Val << SDMMC_NISIER_E_MMC_BLKGE_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the BLKGE status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_DMAINT_Pos         _U_(3)                                               /**< (SDMMC_NISIER) DMA Interrupt Signal Enable Position */
#define SDMMC_NISIER_E_MMC_DMAINT_Msk         (_U_(0x1) << SDMMC_NISIER_E_MMC_DMAINT_Pos)          /**< (SDMMC_NISIER) DMA Interrupt Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_DMAINT(value)      (SDMMC_NISIER_E_MMC_DMAINT_Msk & ((value) << SDMMC_NISIER_E_MMC_DMAINT_Pos))
#define   SDMMC_NISIER_E_MMC_DMAINT_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the DMAINT status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_DMAINT_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the DMAINT status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_DMAINT_MASKED      (SDMMC_NISIER_E_MMC_DMAINT_MASKED_Val << SDMMC_NISIER_E_MMC_DMAINT_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the DMAINT status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_DMAINT_ENABLED     (SDMMC_NISIER_E_MMC_DMAINT_ENABLED_Val << SDMMC_NISIER_E_MMC_DMAINT_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the DMAINT status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BWRRDY_Pos         _U_(4)                                               /**< (SDMMC_NISIER) Buffer Write Ready Signal Enable Position */
#define SDMMC_NISIER_E_MMC_BWRRDY_Msk         (_U_(0x1) << SDMMC_NISIER_E_MMC_BWRRDY_Pos)          /**< (SDMMC_NISIER) Buffer Write Ready Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_BWRRDY(value)      (SDMMC_NISIER_E_MMC_BWRRDY_Msk & ((value) << SDMMC_NISIER_E_MMC_BWRRDY_Pos))
#define   SDMMC_NISIER_E_MMC_BWRRDY_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the BWRRDY status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_BWRRDY_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the BWRRDY status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_BWRRDY_MASKED      (SDMMC_NISIER_E_MMC_BWRRDY_MASKED_Val << SDMMC_NISIER_E_MMC_BWRRDY_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the BWRRDY status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BWRRDY_ENABLED     (SDMMC_NISIER_E_MMC_BWRRDY_ENABLED_Val << SDMMC_NISIER_E_MMC_BWRRDY_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the BWRRDY status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BRDRDY_Pos         _U_(5)                                               /**< (SDMMC_NISIER) Buffer Read Ready Signal Enable Position */
#define SDMMC_NISIER_E_MMC_BRDRDY_Msk         (_U_(0x1) << SDMMC_NISIER_E_MMC_BRDRDY_Pos)          /**< (SDMMC_NISIER) Buffer Read Ready Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_BRDRDY(value)      (SDMMC_NISIER_E_MMC_BRDRDY_Msk & ((value) << SDMMC_NISIER_E_MMC_BRDRDY_Pos))
#define   SDMMC_NISIER_E_MMC_BRDRDY_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the BRDRDY status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_BRDRDY_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the BRDRDY status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_BRDRDY_MASKED      (SDMMC_NISIER_E_MMC_BRDRDY_MASKED_Val << SDMMC_NISIER_E_MMC_BRDRDY_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the BRDRDY status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BRDRDY_ENABLED     (SDMMC_NISIER_E_MMC_BRDRDY_ENABLED_Val << SDMMC_NISIER_E_MMC_BRDRDY_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the BRDRDY status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BOOTAR_Pos         _U_(14)                                              /**< (SDMMC_NISIER) Boot Acknowledge Received Signal Enable Position */
#define SDMMC_NISIER_E_MMC_BOOTAR_Msk         (_U_(0x1) << SDMMC_NISIER_E_MMC_BOOTAR_Pos)          /**< (SDMMC_NISIER) Boot Acknowledge Received Signal Enable Mask */
#define SDMMC_NISIER_E_MMC_BOOTAR(value)      (SDMMC_NISIER_E_MMC_BOOTAR_Msk & ((value) << SDMMC_NISIER_E_MMC_BOOTAR_Pos))
#define   SDMMC_NISIER_E_MMC_BOOTAR_MASKED_Val _U_(0x0)                                             /**< (SDMMC_NISIER) No interrupt is generated when the BOOTAR status rises in SDMMC_NISTR.  */
#define   SDMMC_NISIER_E_MMC_BOOTAR_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_NISIER) An interrupt is generated when the BOOTAR status rises in SDMMC_NISTR.  */
#define SDMMC_NISIER_E_MMC_BOOTAR_MASKED      (SDMMC_NISIER_E_MMC_BOOTAR_MASKED_Val << SDMMC_NISIER_E_MMC_BOOTAR_Pos) /**< (SDMMC_NISIER) No interrupt is generated when the BOOTAR status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_BOOTAR_ENABLED     (SDMMC_NISIER_E_MMC_BOOTAR_ENABLED_Val << SDMMC_NISIER_E_MMC_BOOTAR_Pos) /**< (SDMMC_NISIER) An interrupt is generated when the BOOTAR status rises in SDMMC_NISTR. Position  */
#define SDMMC_NISIER_E_MMC_Msk                _U_(0x403F)                                           /**< (SDMMC_NISIER_E_MMC) Register Mask  */


/* -------- SDMMC_EISIER : (SDMMC Offset: 0x3A) (R/W 16) Error Interrupt Signal Enable Register -------- */
#define SDMMC_EISIER_Msk                      _U_(0x0000)                                          /**< (SDMMC_EISIER) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_EISIER_SD_SDIO_CMDTEO_Pos       _U_(0)                                               /**< (SDMMC_EISIER) Command Timeout Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_CMDTEO_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_CMDTEO_Pos)        /**< (SDMMC_EISIER) Command Timeout Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_CMDTEO(value)    (SDMMC_EISIER_SD_SDIO_CMDTEO_Msk & ((value) << SDMMC_EISIER_SD_SDIO_CMDTEO_Pos))
#define   SDMMC_EISIER_SD_SDIO_CMDTEO_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_CMDTEO_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_CMDTEO_MASKED    (SDMMC_EISIER_SD_SDIO_CMDTEO_MASKED_Val << SDMMC_EISIER_SD_SDIO_CMDTEO_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CMDTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDTEO_ENABLED   (SDMMC_EISIER_SD_SDIO_CMDTEO_ENABLED_Val << SDMMC_EISIER_SD_SDIO_CMDTEO_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDCRC_Pos       _U_(1)                                               /**< (SDMMC_EISIER) Command CRC Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_CMDCRC_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_CMDCRC_Pos)        /**< (SDMMC_EISIER) Command CRC Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_CMDCRC(value)    (SDMMC_EISIER_SD_SDIO_CMDCRC_Msk & ((value) << SDMMC_EISIER_SD_SDIO_CMDCRC_Pos))
#define   SDMMC_EISIER_SD_SDIO_CMDCRC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_CMDCRC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_CMDCRC_MASKED    (SDMMC_EISIER_SD_SDIO_CMDCRC_MASKED_Val << SDMMC_EISIER_SD_SDIO_CMDCRC_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CDMCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDCRC_ENABLED   (SDMMC_EISIER_SD_SDIO_CMDCRC_ENABLED_Val << SDMMC_EISIER_SD_SDIO_CMDCRC_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDEND_Pos       _U_(2)                                               /**< (SDMMC_EISIER) Command End Bit Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_CMDEND_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_CMDEND_Pos)        /**< (SDMMC_EISIER) Command End Bit Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_CMDEND(value)    (SDMMC_EISIER_SD_SDIO_CMDEND_Msk & ((value) << SDMMC_EISIER_SD_SDIO_CMDEND_Pos))
#define   SDMMC_EISIER_SD_SDIO_CMDEND_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CMDEND status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_CMDEND_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDEND status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_CMDEND_MASKED    (SDMMC_EISIER_SD_SDIO_CMDEND_MASKED_Val << SDMMC_EISIER_SD_SDIO_CMDEND_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CMDEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDEND_ENABLED   (SDMMC_EISIER_SD_SDIO_CMDEND_ENABLED_Val << SDMMC_EISIER_SD_SDIO_CMDEND_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDIDX_Pos       _U_(3)                                               /**< (SDMMC_EISIER) Command Index Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_CMDIDX_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_CMDIDX_Pos)        /**< (SDMMC_EISIER) Command Index Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_CMDIDX(value)    (SDMMC_EISIER_SD_SDIO_CMDIDX_Msk & ((value) << SDMMC_EISIER_SD_SDIO_CMDIDX_Pos))
#define   SDMMC_EISIER_SD_SDIO_CMDIDX_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_CMDIDX_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_CMDIDX_MASKED    (SDMMC_EISIER_SD_SDIO_CMDIDX_MASKED_Val << SDMMC_EISIER_SD_SDIO_CMDIDX_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CMDIDX status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CMDIDX_ENABLED   (SDMMC_EISIER_SD_SDIO_CMDIDX_ENABLED_Val << SDMMC_EISIER_SD_SDIO_CMDIDX_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CMDIDX status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_DATTEO_Pos       _U_(4)                                               /**< (SDMMC_EISIER) Data Timeout Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_DATTEO_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_DATTEO_Pos)        /**< (SDMMC_EISIER) Data Timeout Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_DATTEO(value)    (SDMMC_EISIER_SD_SDIO_DATTEO_Msk & ((value) << SDMMC_EISIER_SD_SDIO_DATTEO_Pos))
#define   SDMMC_EISIER_SD_SDIO_DATTEO_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the DATTEO status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_DATTEO_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the DATTEO status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_DATTEO_MASKED    (SDMMC_EISIER_SD_SDIO_DATTEO_MASKED_Val << SDMMC_EISIER_SD_SDIO_DATTEO_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the DATTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_DATTEO_ENABLED   (SDMMC_EISIER_SD_SDIO_DATTEO_ENABLED_Val << SDMMC_EISIER_SD_SDIO_DATTEO_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the DATTEO status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_DATCRC_Pos       _U_(5)                                               /**< (SDMMC_EISIER) Data CRC Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_DATCRC_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_DATCRC_Pos)        /**< (SDMMC_EISIER) Data CRC Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_DATCRC(value)    (SDMMC_EISIER_SD_SDIO_DATCRC_Msk & ((value) << SDMMC_EISIER_SD_SDIO_DATCRC_Pos))
#define   SDMMC_EISIER_SD_SDIO_DATCRC_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the DATCRC status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_DATCRC_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the DATCRC status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_DATCRC_MASKED    (SDMMC_EISIER_SD_SDIO_DATCRC_MASKED_Val << SDMMC_EISIER_SD_SDIO_DATCRC_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the DATCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_DATCRC_ENABLED   (SDMMC_EISIER_SD_SDIO_DATCRC_ENABLED_Val << SDMMC_EISIER_SD_SDIO_DATCRC_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the DATCRC status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_DATEND_Pos       _U_(6)                                               /**< (SDMMC_EISIER) Data End Bit Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_DATEND_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_DATEND_Pos)        /**< (SDMMC_EISIER) Data End Bit Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_DATEND(value)    (SDMMC_EISIER_SD_SDIO_DATEND_Msk & ((value) << SDMMC_EISIER_SD_SDIO_DATEND_Pos))
#define   SDMMC_EISIER_SD_SDIO_DATEND_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the DATEND status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_DATEND_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the DATEND status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_DATEND_MASKED    (SDMMC_EISIER_SD_SDIO_DATEND_MASKED_Val << SDMMC_EISIER_SD_SDIO_DATEND_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the DATEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_DATEND_ENABLED   (SDMMC_EISIER_SD_SDIO_DATEND_ENABLED_Val << SDMMC_EISIER_SD_SDIO_DATEND_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the DATEND status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CURLIM_Pos       _U_(7)                                               /**< (SDMMC_EISIER) Current Limit Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_CURLIM_Msk       (_U_(0x1) << SDMMC_EISIER_SD_SDIO_CURLIM_Pos)        /**< (SDMMC_EISIER) Current Limit Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_CURLIM(value)    (SDMMC_EISIER_SD_SDIO_CURLIM_Msk & ((value) << SDMMC_EISIER_SD_SDIO_CURLIM_Pos))
#define   SDMMC_EISIER_SD_SDIO_CURLIM_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the CURLIM status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_CURLIM_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the CURLIM status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_CURLIM_MASKED    (SDMMC_EISIER_SD_SDIO_CURLIM_MASKED_Val << SDMMC_EISIER_SD_SDIO_CURLIM_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the CURLIM status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_CURLIM_ENABLED   (SDMMC_EISIER_SD_SDIO_CURLIM_ENABLED_Val << SDMMC_EISIER_SD_SDIO_CURLIM_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the CURLIM status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_ACMD_Pos         _U_(8)                                               /**< (SDMMC_EISIER) Auto CMD Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_ACMD_Msk         (_U_(0x1) << SDMMC_EISIER_SD_SDIO_ACMD_Pos)          /**< (SDMMC_EISIER) Auto CMD Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_ACMD(value)      (SDMMC_EISIER_SD_SDIO_ACMD_Msk & ((value) << SDMMC_EISIER_SD_SDIO_ACMD_Pos))
#define   SDMMC_EISIER_SD_SDIO_ACMD_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the ACMD status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_ACMD_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the ACMD status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_ACMD_MASKED      (SDMMC_EISIER_SD_SDIO_ACMD_MASKED_Val << SDMMC_EISIER_SD_SDIO_ACMD_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the ACMD status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_ACMD_ENABLED     (SDMMC_EISIER_SD_SDIO_ACMD_ENABLED_Val << SDMMC_EISIER_SD_SDIO_ACMD_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the ACMD status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_ADMA_Pos         _U_(9)                                               /**< (SDMMC_EISIER) ADMA Error Signal Enable Position */
#define SDMMC_EISIER_SD_SDIO_ADMA_Msk         (_U_(0x1) << SDMMC_EISIER_SD_SDIO_ADMA_Pos)          /**< (SDMMC_EISIER) ADMA Error Signal Enable Mask */
#define SDMMC_EISIER_SD_SDIO_ADMA(value)      (SDMMC_EISIER_SD_SDIO_ADMA_Msk & ((value) << SDMMC_EISIER_SD_SDIO_ADMA_Pos))
#define   SDMMC_EISIER_SD_SDIO_ADMA_MASKED_Val _U_(0x0)                                             /**< (SDMMC_EISIER) No interrupt is generated when the ADMA status rises in SDMMC_EISTR.  */
#define   SDMMC_EISIER_SD_SDIO_ADMA_ENABLED_Val _U_(0x1)                                             /**< (SDMMC_EISIER) An interrupt is generated when the ADMA status rises in SDMMC_EISTR.  */
#define SDMMC_EISIER_SD_SDIO_ADMA_MASKED      (SDMMC_EISIER_SD_SDIO_ADMA_MASKED_Val << SDMMC_EISIER_SD_SDIO_ADMA_Pos) /**< (SDMMC_EISIER) No interrupt is generated when the ADMA status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_ADMA_ENABLED     (SDMMC_EISIER_SD_SDIO_ADMA_ENABLED_Val << SDMMC_EISIER_SD_SDIO_ADMA_Pos) /**< (SDMMC_EISIER) An interrupt is generated when the ADMA status rises in SDMMC_EISTR. Position  */
#define SDMMC_EISIER_SD_SDIO_Msk              _U_(0x03FF)                                           /**< (SDMMC_EISIER_SD_SDIO) Register Mask  */

