Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdmmc.h
/* -------- SDMMC_ACESR : (SDMMC Offset: 0x3C) ( R/ 16) Auto CMD Error Status Register -------- */
#define SDMMC_ACESR_ACMD12NE_Pos              _U_(0)                                               /**< (SDMMC_ACESR) Auto CMD12 Not Executed Position */
#define SDMMC_ACESR_ACMD12NE_Msk              (_U_(0x1) << SDMMC_ACESR_ACMD12NE_Pos)               /**< (SDMMC_ACESR) Auto CMD12 Not Executed Mask */
#define SDMMC_ACESR_ACMD12NE(value)           (SDMMC_ACESR_ACMD12NE_Msk & ((value) << SDMMC_ACESR_ACMD12NE_Pos))
#define SDMMC_ACESR_ACMDTEO_Pos               _U_(1)                                               /**< (SDMMC_ACESR) Auto CMD Timeout Error Position */
#define SDMMC_ACESR_ACMDTEO_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDTEO_Pos)                /**< (SDMMC_ACESR) Auto CMD Timeout Error Mask */
#define SDMMC_ACESR_ACMDTEO(value)            (SDMMC_ACESR_ACMDTEO_Msk & ((value) << SDMMC_ACESR_ACMDTEO_Pos))
#define SDMMC_ACESR_ACMDCRC_Pos               _U_(2)                                               /**< (SDMMC_ACESR) Auto CMD CRC Error Position */
#define SDMMC_ACESR_ACMDCRC_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDCRC_Pos)                /**< (SDMMC_ACESR) Auto CMD CRC Error Mask */
#define SDMMC_ACESR_ACMDCRC(value)            (SDMMC_ACESR_ACMDCRC_Msk & ((value) << SDMMC_ACESR_ACMDCRC_Pos))
#define SDMMC_ACESR_ACMDEND_Pos               _U_(3)                                               /**< (SDMMC_ACESR) Auto CMD End Bit Error Position */
#define SDMMC_ACESR_ACMDEND_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDEND_Pos)                /**< (SDMMC_ACESR) Auto CMD End Bit Error Mask */
#define SDMMC_ACESR_ACMDEND(value)            (SDMMC_ACESR_ACMDEND_Msk & ((value) << SDMMC_ACESR_ACMDEND_Pos))
#define SDMMC_ACESR_ACMDIDX_Pos               _U_(4)                                               /**< (SDMMC_ACESR) Auto CMD Index Error Position */
#define SDMMC_ACESR_ACMDIDX_Msk               (_U_(0x1) << SDMMC_ACESR_ACMDIDX_Pos)                /**< (SDMMC_ACESR) Auto CMD Index Error Mask */
#define SDMMC_ACESR_ACMDIDX(value)            (SDMMC_ACESR_ACMDIDX_Msk & ((value) << SDMMC_ACESR_ACMDIDX_Pos))
#define SDMMC_ACESR_CMDNI_Pos                 _U_(7)                                               /**< (SDMMC_ACESR) Command Not Issued by Auto CMD12 Error Position */
#define SDMMC_ACESR_CMDNI_Msk                 (_U_(0x1) << SDMMC_ACESR_CMDNI_Pos)                  /**< (SDMMC_ACESR) Command Not Issued by Auto CMD12 Error Mask */
#define SDMMC_ACESR_CMDNI(value)              (SDMMC_ACESR_CMDNI_Msk & ((value) << SDMMC_ACESR_CMDNI_Pos))
#define SDMMC_ACESR_Msk                       _U_(0x009F)                                          /**< (SDMMC_ACESR) Register Mask  */


/* -------- SDMMC_HC2R : (SDMMC Offset: 0x3E) (R/W 16) Host Control 2 Register -------- */
#define SDMMC_HC2R_Msk                        _U_(0x0000)                                          /**< (SDMMC_HC2R) Register Mask  */

/* SD_SDIO mode */
#define SDMMC_HC2R_SD_SDIO_ASINTEN_Pos        _U_(14)                                              /**< (SDMMC_HC2R) Asynchronous Interrupt Enable Position */
#define SDMMC_HC2R_SD_SDIO_ASINTEN_Msk        (_U_(0x1) << SDMMC_HC2R_SD_SDIO_ASINTEN_Pos)         /**< (SDMMC_HC2R) Asynchronous Interrupt Enable Mask */
#define SDMMC_HC2R_SD_SDIO_ASINTEN(value)     (SDMMC_HC2R_SD_SDIO_ASINTEN_Msk & ((value) << SDMMC_HC2R_SD_SDIO_ASINTEN_Pos))
#define SDMMC_HC2R_SD_SDIO_PVALEN_Pos         _U_(15)                                              /**< (SDMMC_HC2R) Preset Value Enable Position */
#define SDMMC_HC2R_SD_SDIO_PVALEN_Msk         (_U_(0x1) << SDMMC_HC2R_SD_SDIO_PVALEN_Pos)          /**< (SDMMC_HC2R) Preset Value Enable Mask */
#define SDMMC_HC2R_SD_SDIO_PVALEN(value)      (SDMMC_HC2R_SD_SDIO_PVALEN_Msk & ((value) << SDMMC_HC2R_SD_SDIO_PVALEN_Pos))
#define SDMMC_HC2R_SD_SDIO_Msk                _U_(0xC000)                                           /**< (SDMMC_HC2R_SD_SDIO) Register Mask  */

/* E_MMC mode */
#define SDMMC_HC2R_E_MMC_PVALEN_Pos           _U_(15)                                              /**< (SDMMC_HC2R) Preset Value Enable Position */
#define SDMMC_HC2R_E_MMC_PVALEN_Msk           (_U_(0x1) << SDMMC_HC2R_E_MMC_PVALEN_Pos)            /**< (SDMMC_HC2R) Preset Value Enable Mask */
#define SDMMC_HC2R_E_MMC_PVALEN(value)        (SDMMC_HC2R_E_MMC_PVALEN_Msk & ((value) << SDMMC_HC2R_E_MMC_PVALEN_Pos))
#define SDMMC_HC2R_E_MMC_Msk                  _U_(0x8000)                                           /**< (SDMMC_HC2R_E_MMC) Register Mask  */


/* -------- SDMMC_CA0R : (SDMMC Offset: 0x40) (R/W 32) Capabilities 0 Register -------- */
#define SDMMC_CA0R_TEOCLKF_Pos                _U_(0)                                               /**< (SDMMC_CA0R) Timeout Clock Frequency Position */
#define SDMMC_CA0R_TEOCLKF_Msk                (_U_(0x3F) << SDMMC_CA0R_TEOCLKF_Pos)                /**< (SDMMC_CA0R) Timeout Clock Frequency Mask */
#define SDMMC_CA0R_TEOCLKF(value)             (SDMMC_CA0R_TEOCLKF_Msk & ((value) << SDMMC_CA0R_TEOCLKF_Pos))
#define SDMMC_CA0R_TEOCLKU_Pos                _U_(7)                                               /**< (SDMMC_CA0R) Timeout Clock Unit Position */
#define SDMMC_CA0R_TEOCLKU_Msk                (_U_(0x1) << SDMMC_CA0R_TEOCLKU_Pos)                 /**< (SDMMC_CA0R) Timeout Clock Unit Mask */
#define SDMMC_CA0R_TEOCLKU(value)             (SDMMC_CA0R_TEOCLKU_Msk & ((value) << SDMMC_CA0R_TEOCLKU_Pos))
#define SDMMC_CA0R_BASECLKF_Pos               _U_(8)                                               /**< (SDMMC_CA0R) Base Clock Frequency Position */
#define SDMMC_CA0R_BASECLKF_Msk               (_U_(0xFF) << SDMMC_CA0R_BASECLKF_Pos)               /**< (SDMMC_CA0R) Base Clock Frequency Mask */
#define SDMMC_CA0R_BASECLKF(value)            (SDMMC_CA0R_BASECLKF_Msk & ((value) << SDMMC_CA0R_BASECLKF_Pos))
#define SDMMC_CA0R_MAXBLKL_Pos                _U_(16)                                              /**< (SDMMC_CA0R) Max Block Length Position */
#define SDMMC_CA0R_MAXBLKL_Msk                (_U_(0x3) << SDMMC_CA0R_MAXBLKL_Pos)                 /**< (SDMMC_CA0R) Max Block Length Mask */
#define SDMMC_CA0R_MAXBLKL(value)             (SDMMC_CA0R_MAXBLKL_Msk & ((value) << SDMMC_CA0R_MAXBLKL_Pos))
#define   SDMMC_CA0R_MAXBLKL_512_Val          _U_(0x0)                                             /**< (SDMMC_CA0R) 512 bytes  */
#define   SDMMC_CA0R_MAXBLKL_1024_Val         _U_(0x1)                                             /**< (SDMMC_CA0R) 1024 bytes  */
#define   SDMMC_CA0R_MAXBLKL_2048_Val         _U_(0x2)                                             /**< (SDMMC_CA0R) 2048 bytes  */
#define SDMMC_CA0R_MAXBLKL_512                (SDMMC_CA0R_MAXBLKL_512_Val << SDMMC_CA0R_MAXBLKL_Pos) /**< (SDMMC_CA0R) 512 bytes Position  */
#define SDMMC_CA0R_MAXBLKL_1024               (SDMMC_CA0R_MAXBLKL_1024_Val << SDMMC_CA0R_MAXBLKL_Pos) /**< (SDMMC_CA0R) 1024 bytes Position  */
#define SDMMC_CA0R_MAXBLKL_2048               (SDMMC_CA0R_MAXBLKL_2048_Val << SDMMC_CA0R_MAXBLKL_Pos) /**< (SDMMC_CA0R) 2048 bytes Position  */
#define SDMMC_CA0R_ED8SUP_Pos                 _U_(18)                                              /**< (SDMMC_CA0R) 8-Bit Support for Embedded Device Position */
#define SDMMC_CA0R_ED8SUP_Msk                 (_U_(0x1) << SDMMC_CA0R_ED8SUP_Pos)                  /**< (SDMMC_CA0R) 8-Bit Support for Embedded Device Mask */
#define SDMMC_CA0R_ED8SUP(value)              (SDMMC_CA0R_ED8SUP_Msk & ((value) << SDMMC_CA0R_ED8SUP_Pos))
#define SDMMC_CA0R_ADMA2SUP_Pos               _U_(19)                                              /**< (SDMMC_CA0R) ADMA2 Support Position */
#define SDMMC_CA0R_ADMA2SUP_Msk               (_U_(0x1) << SDMMC_CA0R_ADMA2SUP_Pos)                /**< (SDMMC_CA0R) ADMA2 Support Mask */
#define SDMMC_CA0R_ADMA2SUP(value)            (SDMMC_CA0R_ADMA2SUP_Msk & ((value) << SDMMC_CA0R_ADMA2SUP_Pos))
#define SDMMC_CA0R_HSSUP_Pos                  _U_(21)                                              /**< (SDMMC_CA0R) High Speed Support Position */
#define SDMMC_CA0R_HSSUP_Msk                  (_U_(0x1) << SDMMC_CA0R_HSSUP_Pos)                   /**< (SDMMC_CA0R) High Speed Support Mask */
#define SDMMC_CA0R_HSSUP(value)               (SDMMC_CA0R_HSSUP_Msk & ((value) << SDMMC_CA0R_HSSUP_Pos))
#define SDMMC_CA0R_SDMASUP_Pos                _U_(22)                                              /**< (SDMMC_CA0R) SDMA Support Position */
#define SDMMC_CA0R_SDMASUP_Msk                (_U_(0x1) << SDMMC_CA0R_SDMASUP_Pos)                 /**< (SDMMC_CA0R) SDMA Support Mask */
#define SDMMC_CA0R_SDMASUP(value)             (SDMMC_CA0R_SDMASUP_Msk & ((value) << SDMMC_CA0R_SDMASUP_Pos))
#define SDMMC_CA0R_SRSUP_Pos                  _U_(23)                                              /**< (SDMMC_CA0R) Suspend/Resume Support Position */
#define SDMMC_CA0R_SRSUP_Msk                  (_U_(0x1) << SDMMC_CA0R_SRSUP_Pos)                   /**< (SDMMC_CA0R) Suspend/Resume Support Mask */
#define SDMMC_CA0R_SRSUP(value)               (SDMMC_CA0R_SRSUP_Msk & ((value) << SDMMC_CA0R_SRSUP_Pos))
#define SDMMC_CA0R_V33VSUP_Pos                _U_(24)                                              /**< (SDMMC_CA0R) Voltage Support 3.3V Position */
#define SDMMC_CA0R_V33VSUP_Msk                (_U_(0x1) << SDMMC_CA0R_V33VSUP_Pos)                 /**< (SDMMC_CA0R) Voltage Support 3.3V Mask */
#define SDMMC_CA0R_V33VSUP(value)             (SDMMC_CA0R_V33VSUP_Msk & ((value) << SDMMC_CA0R_V33VSUP_Pos))
#define SDMMC_CA0R_V30VSUP_Pos                _U_(25)                                              /**< (SDMMC_CA0R) Voltage Support 3.0V Position */
#define SDMMC_CA0R_V30VSUP_Msk                (_U_(0x1) << SDMMC_CA0R_V30VSUP_Pos)                 /**< (SDMMC_CA0R) Voltage Support 3.0V Mask */
#define SDMMC_CA0R_V30VSUP(value)             (SDMMC_CA0R_V30VSUP_Msk & ((value) << SDMMC_CA0R_V30VSUP_Pos))
#define SDMMC_CA0R_V18VSUP_Pos                _U_(26)                                              /**< (SDMMC_CA0R) Voltage Support 1.8V Position */
#define SDMMC_CA0R_V18VSUP_Msk                (_U_(0x1) << SDMMC_CA0R_V18VSUP_Pos)                 /**< (SDMMC_CA0R) Voltage Support 1.8V Mask */
#define SDMMC_CA0R_V18VSUP(value)             (SDMMC_CA0R_V18VSUP_Msk & ((value) << SDMMC_CA0R_V18VSUP_Pos))
#define SDMMC_CA0R_SB64SUP_Pos                _U_(28)                                              /**< (SDMMC_CA0R) 64-Bit System Bus Support Position */
#define SDMMC_CA0R_SB64SUP_Msk                (_U_(0x1) << SDMMC_CA0R_SB64SUP_Pos)                 /**< (SDMMC_CA0R) 64-Bit System Bus Support Mask */
#define SDMMC_CA0R_SB64SUP(value)             (SDMMC_CA0R_SB64SUP_Msk & ((value) << SDMMC_CA0R_SB64SUP_Pos))
#define SDMMC_CA0R_ASINTSUP_Pos               _U_(29)                                              /**< (SDMMC_CA0R) Asynchronous Interrupt Support Position */
#define SDMMC_CA0R_ASINTSUP_Msk               (_U_(0x1) << SDMMC_CA0R_ASINTSUP_Pos)                /**< (SDMMC_CA0R) Asynchronous Interrupt Support Mask */
#define SDMMC_CA0R_ASINTSUP(value)            (SDMMC_CA0R_ASINTSUP_Msk & ((value) << SDMMC_CA0R_ASINTSUP_Pos))
#define SDMMC_CA0R_SLTYPE_Pos                 _U_(30)                                              /**< (SDMMC_CA0R) Slot Type Position */
#define SDMMC_CA0R_SLTYPE_Msk                 (_U_(0x3) << SDMMC_CA0R_SLTYPE_Pos)                  /**< (SDMMC_CA0R) Slot Type Mask */
#define SDMMC_CA0R_SLTYPE(value)              (SDMMC_CA0R_SLTYPE_Msk & ((value) << SDMMC_CA0R_SLTYPE_Pos))
#define SDMMC_CA0R_Msk                        _U_(0xF7EFFFBF)                                      /**< (SDMMC_CA0R) Register Mask  */


/* -------- SDMMC_CA1R : (SDMMC Offset: 0x44) (R/W 32) Capabilities 1 Register -------- */
#define SDMMC_CA1R_SDR50SUP_Pos               _U_(0)                                               /**< (SDMMC_CA1R) SDR50 Support Position */
#define SDMMC_CA1R_SDR50SUP_Msk               (_U_(0x1) << SDMMC_CA1R_SDR50SUP_Pos)                /**< (SDMMC_CA1R) SDR50 Support Mask */
#define SDMMC_CA1R_SDR50SUP(value)            (SDMMC_CA1R_SDR50SUP_Msk & ((value) << SDMMC_CA1R_SDR50SUP_Pos))
#define SDMMC_CA1R_SDR104SUP_Pos              _U_(1)                                               /**< (SDMMC_CA1R) SDR104 Support Position */
#define SDMMC_CA1R_SDR104SUP_Msk              (_U_(0x1) << SDMMC_CA1R_SDR104SUP_Pos)               /**< (SDMMC_CA1R) SDR104 Support Mask */
#define SDMMC_CA1R_SDR104SUP(value)           (SDMMC_CA1R_SDR104SUP_Msk & ((value) << SDMMC_CA1R_SDR104SUP_Pos))
#define SDMMC_CA1R_DDR50SUP_Pos               _U_(2)                                               /**< (SDMMC_CA1R) DDR50 Support Position */
#define SDMMC_CA1R_DDR50SUP_Msk               (_U_(0x1) << SDMMC_CA1R_DDR50SUP_Pos)                /**< (SDMMC_CA1R) DDR50 Support Mask */
#define SDMMC_CA1R_DDR50SUP(value)            (SDMMC_CA1R_DDR50SUP_Msk & ((value) << SDMMC_CA1R_DDR50SUP_Pos))
#define SDMMC_CA1R_DRVASUP_Pos                _U_(4)                                               /**< (SDMMC_CA1R) Driver Type A Support Position */
#define SDMMC_CA1R_DRVASUP_Msk                (_U_(0x1) << SDMMC_CA1R_DRVASUP_Pos)                 /**< (SDMMC_CA1R) Driver Type A Support Mask */
#define SDMMC_CA1R_DRVASUP(value)             (SDMMC_CA1R_DRVASUP_Msk & ((value) << SDMMC_CA1R_DRVASUP_Pos))
#define SDMMC_CA1R_DRVCSUP_Pos                _U_(5)                                               /**< (SDMMC_CA1R) Driver Type C Support Position */
#define SDMMC_CA1R_DRVCSUP_Msk                (_U_(0x1) << SDMMC_CA1R_DRVCSUP_Pos)                 /**< (SDMMC_CA1R) Driver Type C Support Mask */
#define SDMMC_CA1R_DRVCSUP(value)             (SDMMC_CA1R_DRVCSUP_Msk & ((value) << SDMMC_CA1R_DRVCSUP_Pos))
#define SDMMC_CA1R_DRVDSUP_Pos                _U_(6)                                               /**< (SDMMC_CA1R) Driver Type D Support Position */
#define SDMMC_CA1R_DRVDSUP_Msk                (_U_(0x1) << SDMMC_CA1R_DRVDSUP_Pos)                 /**< (SDMMC_CA1R) Driver Type D Support Mask */
#define SDMMC_CA1R_DRVDSUP(value)             (SDMMC_CA1R_DRVDSUP_Msk & ((value) << SDMMC_CA1R_DRVDSUP_Pos))
#define SDMMC_CA1R_CLKMULT_Pos                _U_(16)                                              /**< (SDMMC_CA1R) Clock Multiplier Position */
#define SDMMC_CA1R_CLKMULT_Msk                (_U_(0xFF) << SDMMC_CA1R_CLKMULT_Pos)                /**< (SDMMC_CA1R) Clock Multiplier Mask */
#define SDMMC_CA1R_CLKMULT(value)             (SDMMC_CA1R_CLKMULT_Msk & ((value) << SDMMC_CA1R_CLKMULT_Pos))
#define SDMMC_CA1R_Msk                        _U_(0x00FF0077)                                      /**< (SDMMC_CA1R) Register Mask  */


