Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdmmc.h
/* -------- SDMMC_MC1R : (SDMMC Offset: 0x204) (R/W 8) e.MMC Control 1 Register -------- */
#define SDMMC_MC1R_CMDTYP_Pos                 _U_(0)                                               /**< (SDMMC_MC1R) e.MMC Command Type Position */
#define SDMMC_MC1R_CMDTYP_Msk                 (_U_(0x3) << SDMMC_MC1R_CMDTYP_Pos)                  /**< (SDMMC_MC1R) e.MMC Command Type Mask */
#define SDMMC_MC1R_CMDTYP(value)              (SDMMC_MC1R_CMDTYP_Msk & ((value) << SDMMC_MC1R_CMDTYP_Pos))
#define   SDMMC_MC1R_CMDTYP_NORMAL_Val        _U_(0x0)                                             /**< (SDMMC_MC1R) The command is not an e.MMC specific command.  */
#define   SDMMC_MC1R_CMDTYP_WAITIRQ_Val       _U_(0x1)                                             /**< (SDMMC_MC1R) This bit must be set to 1 when the e.MMC is in Interrupt mode (CMD40). See "Interrupt Mode" in the Embedded MultiMedia Card (e.MMC) Electrical Standard 4.51.  */
#define   SDMMC_MC1R_CMDTYP_STREAM_Val        _U_(0x2)                                             /**< (SDMMC_MC1R) This bit must be set to 1 in the case of Stream Read(CMD11) or Stream Write (CMD20). Only effective for e.MMC up to revision 4.41.  */
#define   SDMMC_MC1R_CMDTYP_BOOT_Val          _U_(0x3)                                             /**< (SDMMC_MC1R) Starts a Boot Operation mode at the next write to SDMMC_CR. Boot data are read directly from e.MMC device.  */
#define SDMMC_MC1R_CMDTYP_NORMAL              (SDMMC_MC1R_CMDTYP_NORMAL_Val << SDMMC_MC1R_CMDTYP_Pos) /**< (SDMMC_MC1R) The command is not an e.MMC specific command. Position  */
#define SDMMC_MC1R_CMDTYP_WAITIRQ             (SDMMC_MC1R_CMDTYP_WAITIRQ_Val << SDMMC_MC1R_CMDTYP_Pos) /**< (SDMMC_MC1R) This bit must be set to 1 when the e.MMC is in Interrupt mode (CMD40). See "Interrupt Mode" in the Embedded MultiMedia Card (e.MMC) Electrical Standard 4.51. Position  */
#define SDMMC_MC1R_CMDTYP_STREAM              (SDMMC_MC1R_CMDTYP_STREAM_Val << SDMMC_MC1R_CMDTYP_Pos) /**< (SDMMC_MC1R) This bit must be set to 1 in the case of Stream Read(CMD11) or Stream Write (CMD20). Only effective for e.MMC up to revision 4.41. Position  */
#define SDMMC_MC1R_CMDTYP_BOOT                (SDMMC_MC1R_CMDTYP_BOOT_Val << SDMMC_MC1R_CMDTYP_Pos) /**< (SDMMC_MC1R) Starts a Boot Operation mode at the next write to SDMMC_CR. Boot data are read directly from e.MMC device. Position  */
#define SDMMC_MC1R_DDR_Pos                    _U_(3)                                               /**< (SDMMC_MC1R) e.MMC HSDDR Mode Position */
#define SDMMC_MC1R_DDR_Msk                    (_U_(0x1) << SDMMC_MC1R_DDR_Pos)                     /**< (SDMMC_MC1R) e.MMC HSDDR Mode Mask */
#define SDMMC_MC1R_DDR(value)                 (SDMMC_MC1R_DDR_Msk & ((value) << SDMMC_MC1R_DDR_Pos))
#define SDMMC_MC1R_OPD_Pos                    _U_(4)                                               /**< (SDMMC_MC1R) e.MMC Open Drain Mode Position */
#define SDMMC_MC1R_OPD_Msk                    (_U_(0x1) << SDMMC_MC1R_OPD_Pos)                     /**< (SDMMC_MC1R) e.MMC Open Drain Mode Mask */
#define SDMMC_MC1R_OPD(value)                 (SDMMC_MC1R_OPD_Msk & ((value) << SDMMC_MC1R_OPD_Pos))
#define SDMMC_MC1R_BOOTA_Pos                  _U_(5)                                               /**< (SDMMC_MC1R) e.MMC Boot Acknowledge Enable Position */
#define SDMMC_MC1R_BOOTA_Msk                  (_U_(0x1) << SDMMC_MC1R_BOOTA_Pos)                   /**< (SDMMC_MC1R) e.MMC Boot Acknowledge Enable Mask */
#define SDMMC_MC1R_BOOTA(value)               (SDMMC_MC1R_BOOTA_Msk & ((value) << SDMMC_MC1R_BOOTA_Pos))
#define SDMMC_MC1R_Msk                        _U_(0x3B)                                            /**< (SDMMC_MC1R) Register Mask  */


/* -------- SDMMC_MC2R : (SDMMC Offset: 0x205) ( /W 8) e.MMC Control 2 Register -------- */
#define SDMMC_MC2R_SRESP_Pos                  _U_(0)                                               /**< (SDMMC_MC2R) e.MMC Abort Wait IRQ Position */
#define SDMMC_MC2R_SRESP_Msk                  (_U_(0x1) << SDMMC_MC2R_SRESP_Pos)                   /**< (SDMMC_MC2R) e.MMC Abort Wait IRQ Mask */
#define SDMMC_MC2R_SRESP(value)               (SDMMC_MC2R_SRESP_Msk & ((value) << SDMMC_MC2R_SRESP_Pos))
#define SDMMC_MC2R_ABOOT_Pos                  _U_(1)                                               /**< (SDMMC_MC2R) e.MMC Abort Boot Position */
#define SDMMC_MC2R_ABOOT_Msk                  (_U_(0x1) << SDMMC_MC2R_ABOOT_Pos)                   /**< (SDMMC_MC2R) e.MMC Abort Boot Mask */
#define SDMMC_MC2R_ABOOT(value)               (SDMMC_MC2R_ABOOT_Msk & ((value) << SDMMC_MC2R_ABOOT_Pos))
#define SDMMC_MC2R_Msk                        _U_(0x03)                                            /**< (SDMMC_MC2R) Register Mask  */


/* -------- SDMMC_ACR : (SDMMC Offset: 0x208) (R/W 32) AHB Control Register -------- */
#define SDMMC_ACR_BMAX_Pos                    _U_(0)                                               /**< (SDMMC_ACR) AHB Maximum Burst Position */
#define SDMMC_ACR_BMAX_Msk                    (_U_(0x3) << SDMMC_ACR_BMAX_Pos)                     /**< (SDMMC_ACR) AHB Maximum Burst Mask */
#define SDMMC_ACR_BMAX(value)                 (SDMMC_ACR_BMAX_Msk & ((value) << SDMMC_ACR_BMAX_Pos))
#define   SDMMC_ACR_BMAX_INCR16_Val           _U_(0x0)                                             /**< (SDMMC_ACR) The maximum burst size is INCR16.  */
#define   SDMMC_ACR_BMAX_INCR8_Val            _U_(0x1)                                             /**< (SDMMC_ACR) The maximum burst size is INCR8.  */
#define   SDMMC_ACR_BMAX_INCR4_Val            _U_(0x2)                                             /**< (SDMMC_ACR) The maximum burst size is INCR4.  */
#define   SDMMC_ACR_BMAX_SINGLE_Val           _U_(0x3)                                             /**< (SDMMC_ACR) Only SINGLE transfers are performed.  */
#define SDMMC_ACR_BMAX_INCR16                 (SDMMC_ACR_BMAX_INCR16_Val << SDMMC_ACR_BMAX_Pos)    /**< (SDMMC_ACR) The maximum burst size is INCR16. Position  */
#define SDMMC_ACR_BMAX_INCR8                  (SDMMC_ACR_BMAX_INCR8_Val << SDMMC_ACR_BMAX_Pos)     /**< (SDMMC_ACR) The maximum burst size is INCR8. Position  */
#define SDMMC_ACR_BMAX_INCR4                  (SDMMC_ACR_BMAX_INCR4_Val << SDMMC_ACR_BMAX_Pos)     /**< (SDMMC_ACR) The maximum burst size is INCR4. Position  */
#define SDMMC_ACR_BMAX_SINGLE                 (SDMMC_ACR_BMAX_SINGLE_Val << SDMMC_ACR_BMAX_Pos)    /**< (SDMMC_ACR) Only SINGLE transfers are performed. Position  */
#define SDMMC_ACR_HNBRDIS_Pos                 _U_(4)                                               /**< (SDMMC_ACR) HNBREQ Disable Position */
#define SDMMC_ACR_HNBRDIS_Msk                 (_U_(0x1) << SDMMC_ACR_HNBRDIS_Pos)                  /**< (SDMMC_ACR) HNBREQ Disable Mask */
#define SDMMC_ACR_HNBRDIS(value)              (SDMMC_ACR_HNBRDIS_Msk & ((value) << SDMMC_ACR_HNBRDIS_Pos))
#define SDMMC_ACR_B1KBDIS_Pos                 _U_(5)                                               /**< (SDMMC_ACR) 1kB Boundary Disable Position */
#define SDMMC_ACR_B1KBDIS_Msk                 (_U_(0x1) << SDMMC_ACR_B1KBDIS_Pos)                  /**< (SDMMC_ACR) 1kB Boundary Disable Mask */
#define SDMMC_ACR_B1KBDIS(value)              (SDMMC_ACR_B1KBDIS_Msk & ((value) << SDMMC_ACR_B1KBDIS_Pos))
#define SDMMC_ACR_Msk                         _U_(0x00000033)                                      /**< (SDMMC_ACR) Register Mask  */


/* -------- SDMMC_CC2R : (SDMMC Offset: 0x20C) (R/W 32) Clock Control 2 Register -------- */
#define SDMMC_CC2R_FSDCLKD_Pos                _U_(0)                                               /**< (SDMMC_CC2R) Force SDCLK Disabled Position */
#define SDMMC_CC2R_FSDCLKD_Msk                (_U_(0x1) << SDMMC_CC2R_FSDCLKD_Pos)                 /**< (SDMMC_CC2R) Force SDCLK Disabled Mask */
#define SDMMC_CC2R_FSDCLKD(value)             (SDMMC_CC2R_FSDCLKD_Msk & ((value) << SDMMC_CC2R_FSDCLKD_Pos))
#define SDMMC_CC2R_Msk                        _U_(0x00000001)                                      /**< (SDMMC_CC2R) Register Mask  */


/* -------- SDMMC_TUNSR : (SDMMC Offset: 0x224) ( R/ 32) Tuning Status Register -------- */
#define SDMMC_TUNSR_DLLPS_Pos                 _U_(0)                                               /**< (SDMMC_TUNSR) Tuning DLL Phase Status Position */
#define SDMMC_TUNSR_DLLPS_Msk                 (_U_(0xF) << SDMMC_TUNSR_DLLPS_Pos)                  /**< (SDMMC_TUNSR) Tuning DLL Phase Status Mask */
#define SDMMC_TUNSR_DLLPS(value)              (SDMMC_TUNSR_DLLPS_Msk & ((value) << SDMMC_TUNSR_DLLPS_Pos))
#define SDMMC_TUNSR_SMPLES_Pos                _U_(8)                                               /**< (SDMMC_TUNSR) Tuning Sampling SDCLK Edge Status Position */
#define SDMMC_TUNSR_SMPLES_Msk                (_U_(0x1) << SDMMC_TUNSR_SMPLES_Pos)                 /**< (SDMMC_TUNSR) Tuning Sampling SDCLK Edge Status Mask */
#define SDMMC_TUNSR_SMPLES(value)             (SDMMC_TUNSR_SMPLES_Msk & ((value) << SDMMC_TUNSR_SMPLES_Pos))
#define SDMMC_TUNSR_Msk                       _U_(0x0000010F)                                      /**< (SDMMC_TUNSR) Register Mask  */


