Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdmmc.h
/* -------- SDMMC_CACR : (SDMMC Offset: 0x230) (R/W 32) Capabilities Control Register -------- */
#define SDMMC_CACR_CAPWREN_Pos                _U_(0)                                               /**< (SDMMC_CACR) Capabilities Write Enable Position */
#define SDMMC_CACR_CAPWREN_Msk                (_U_(0x1) << SDMMC_CACR_CAPWREN_Pos)                 /**< (SDMMC_CACR) Capabilities Write Enable Mask */
#define SDMMC_CACR_CAPWREN(value)             (SDMMC_CACR_CAPWREN_Msk & ((value) << SDMMC_CACR_CAPWREN_Pos))
#define SDMMC_CACR_KEY_Pos                    _U_(8)                                               /**< (SDMMC_CACR) Key Position */
#define SDMMC_CACR_KEY_Msk                    (_U_(0xFF) << SDMMC_CACR_KEY_Pos)                    /**< (SDMMC_CACR) Key Mask */
#define SDMMC_CACR_KEY(value)                 (SDMMC_CACR_KEY_Msk & ((value) << SDMMC_CACR_KEY_Pos))
#define SDMMC_CACR_Msk                        _U_(0x0000FF01)                                      /**< (SDMMC_CACR) Register Mask  */


/* -------- SDMMC_DBGR : (SDMMC Offset: 0x234) (R/W 32) Debug Register -------- */
#define SDMMC_DBGR_NIDBG_Pos                  _U_(0)                                               /**< (SDMMC_DBGR) Nonintrusive Debug Position */
#define SDMMC_DBGR_NIDBG_Msk                  (_U_(0x1) << SDMMC_DBGR_NIDBG_Pos)                   /**< (SDMMC_DBGR) Nonintrusive Debug Mask */
#define SDMMC_DBGR_NIDBG(value)               (SDMMC_DBGR_NIDBG_Msk & ((value) << SDMMC_DBGR_NIDBG_Pos))
#define   SDMMC_DBGR_NIDBG_DISABLED_Val       _U_(0x0)                                             /**< (SDMMC_DBGR) Reading the SDMMC_BDPR via debugger increments the dual port RAM read pointer.  */
#define   SDMMC_DBGR_NIDBG_ENABLED_Val        _U_(0x1)                                             /**< (SDMMC_DBGR) Reading the SDMMC_BDPR via debugger does not increment the dual port RAM read pointer.  */
#define SDMMC_DBGR_NIDBG_DISABLED             (SDMMC_DBGR_NIDBG_DISABLED_Val << SDMMC_DBGR_NIDBG_Pos) /**< (SDMMC_DBGR) Reading the SDMMC_BDPR via debugger increments the dual port RAM read pointer. Position  */
#define SDMMC_DBGR_NIDBG_ENABLED              (SDMMC_DBGR_NIDBG_ENABLED_Val << SDMMC_DBGR_NIDBG_Pos) /**< (SDMMC_DBGR) Reading the SDMMC_BDPR via debugger does not increment the dual port RAM read pointer. Position  */
#define SDMMC_DBGR_Msk                        _U_(0x00000001)                                      /**< (SDMMC_DBGR) Register Mask  */


/* -------- SDMMC_VERSION1 : (SDMMC Offset: 0x2E8) ( R/ 32) Version Register 1 -------- */
#define SDMMC_VERSION1_VERSION_Pos            _U_(0)                                               /**< (SDMMC_VERSION1) Version of the Hardware Module Position */
#define SDMMC_VERSION1_VERSION_Msk            (_U_(0xFFFFFFFF) << SDMMC_VERSION1_VERSION_Pos)      /**< (SDMMC_VERSION1) Version of the Hardware Module Mask */
#define SDMMC_VERSION1_VERSION(value)         (SDMMC_VERSION1_VERSION_Msk & ((value) << SDMMC_VERSION1_VERSION_Pos))
#define SDMMC_VERSION1_Msk                    _U_(0xFFFFFFFF)                                      /**< (SDMMC_VERSION1) Register Mask  */


/* -------- SDMMC_VERSION2 : (SDMMC Offset: 0x2EC) ( R/ 32) Version Register 2 -------- */
#define SDMMC_VERSION2_VERSION_Pos            _U_(0)                                               /**< (SDMMC_VERSION2) Version of the Hardware Module Position */
#define SDMMC_VERSION2_VERSION_Msk            (_U_(0xFFFFFFFF) << SDMMC_VERSION2_VERSION_Pos)      /**< (SDMMC_VERSION2) Version of the Hardware Module Mask */
#define SDMMC_VERSION2_VERSION(value)         (SDMMC_VERSION2_VERSION_Msk & ((value) << SDMMC_VERSION2_VERSION_Pos))
#define SDMMC_VERSION2_Msk                    _U_(0xFFFFFFFF)                                      /**< (SDMMC_VERSION2) Register Mask  */


/* -------- SDMMC_VERSION3 : (SDMMC Offset: 0x2FC) ( R/ 32) Version Register 3 -------- */
#define SDMMC_VERSION3_VERSION_Pos            _U_(0)                                               /**< (SDMMC_VERSION3) Version of the Hardware Module Position */
#define SDMMC_VERSION3_VERSION_Msk            (_U_(0xFFFFFFFF) << SDMMC_VERSION3_VERSION_Pos)      /**< (SDMMC_VERSION3) Version of the Hardware Module Mask */
#define SDMMC_VERSION3_VERSION(value)         (SDMMC_VERSION3_VERSION_Msk & ((value) << SDMMC_VERSION3_VERSION_Pos))
#define SDMMC_VERSION3_Msk                    _U_(0xFFFFFFFF)                                      /**< (SDMMC_VERSION3) Register Mask  */


/** \brief SDMMC register offsets definitions */
#define SDMMC_SSAR_REG_OFST            (0x00)              /**< (SDMMC_SSAR) SDMA System Address / Argument 2 Register Offset */
#define SDMMC_BSR_REG_OFST             (0x04)              /**< (SDMMC_BSR) Block Size Register Offset */
#define SDMMC_BCR_REG_OFST             (0x06)              /**< (SDMMC_BCR) Block Count Register Offset */
#define SDMMC_ARG1R_REG_OFST           (0x08)              /**< (SDMMC_ARG1R) Argument 1 Register Offset */
#define SDMMC_TMR_REG_OFST             (0x0C)              /**< (SDMMC_TMR) Transfer Mode Register Offset */
#define SDMMC_CR_REG_OFST              (0x0E)              /**< (SDMMC_CR) Command Register Offset */
#define SDMMC_RR_REG_OFST              (0x10)              /**< (SDMMC_RR) Response Register Offset */
#define SDMMC_BDPR_REG_OFST            (0x20)              /**< (SDMMC_BDPR) Buffer Data Port Register Offset */
#define SDMMC_PSR_REG_OFST             (0x24)              /**< (SDMMC_PSR) Present State Register Offset */
#define SDMMC_HC1R_REG_OFST            (0x28)              /**< (SDMMC_HC1R) Host Control 1 Register Offset */
#define SDMMC_PCR_REG_OFST             (0x29)              /**< (SDMMC_PCR) Power Control Register Offset */
#define SDMMC_BGCR_REG_OFST            (0x2A)              /**< (SDMMC_BGCR) Block Gap Control Register Offset */
#define SDMMC_WCR_REG_OFST             (0x2B)              /**< (SDMMC_WCR) Wakeup Control Register Offset */
#define SDMMC_CCR_REG_OFST             (0x2C)              /**< (SDMMC_CCR) Clock Control Register Offset */
#define SDMMC_TCR_REG_OFST             (0x2E)              /**< (SDMMC_TCR) Timeout Control Register Offset */
#define SDMMC_SRR_REG_OFST             (0x2F)              /**< (SDMMC_SRR) Software Reset Register Offset */
#define SDMMC_NISTR_REG_OFST           (0x30)              /**< (SDMMC_NISTR) Normal Interrupt Status Register Offset */
#define SDMMC_EISTR_REG_OFST           (0x32)              /**< (SDMMC_EISTR) Error Interrupt Status Register Offset */
#define SDMMC_NISTER_REG_OFST          (0x34)              /**< (SDMMC_NISTER) Normal Interrupt Status Enable Register Offset */
#define SDMMC_EISTER_REG_OFST          (0x36)              /**< (SDMMC_EISTER) Error Interrupt Status Enable Register Offset */
#define SDMMC_NISIER_REG_OFST          (0x38)              /**< (SDMMC_NISIER) Normal Interrupt Signal Enable Register Offset */
#define SDMMC_EISIER_REG_OFST          (0x3A)              /**< (SDMMC_EISIER) Error Interrupt Signal Enable Register Offset */
#define SDMMC_ACESR_REG_OFST           (0x3C)              /**< (SDMMC_ACESR) Auto CMD Error Status Register Offset */
#define SDMMC_HC2R_REG_OFST            (0x3E)              /**< (SDMMC_HC2R) Host Control 2 Register Offset */
#define SDMMC_CA0R_REG_OFST            (0x40)              /**< (SDMMC_CA0R) Capabilities 0 Register Offset */
#define SDMMC_CA1R_REG_OFST            (0x44)              /**< (SDMMC_CA1R) Capabilities 1 Register Offset */
#define SDMMC_MCCAR_REG_OFST           (0x48)              /**< (SDMMC_MCCAR) Maximum Current Capabilities Register Offset */
#define SDMMC_FERACES_REG_OFST         (0x50)              /**< (SDMMC_FERACES) Force Event Register for Auto CMD Error Status Offset */
#define SDMMC_FEREIS_REG_OFST          (0x52)              /**< (SDMMC_FEREIS) Force Event Register for Error Interrupt Status Offset */
#define SDMMC_AESR_REG_OFST            (0x54)              /**< (SDMMC_AESR) ADMA Error Status Register Offset */
#define SDMMC_ASAR0_REG_OFST           (0x58)              /**< (SDMMC_ASAR0) ADMA System Address Register 0 Offset */
#define SDMMC_PVR_REG_OFST             (0x60)              /**< (SDMMC_PVR) Preset Value Register 0 (for initialization) Offset */
#define SDMMC_SISR_REG_OFST            (0xFC)              /**< (SDMMC_SISR) Slot Interrupt Status Register Offset */
#define SDMMC_HCVR_REG_OFST            (0xFE)              /**< (SDMMC_HCVR) Host Controller Version Register Offset */
#define SDMMC_APSR_REG_OFST            (0x200)             /**< (SDMMC_APSR) Additional Present State Register Offset */
#define SDMMC_MC1R_REG_OFST            (0x204)             /**< (SDMMC_MC1R) e.MMC Control 1 Register Offset */
#define SDMMC_MC2R_REG_OFST            (0x205)             /**< (SDMMC_MC2R) e.MMC Control 2 Register Offset */
#define SDMMC_ACR_REG_OFST             (0x208)             /**< (SDMMC_ACR) AHB Control Register Offset */
#define SDMMC_CC2R_REG_OFST            (0x20C)             /**< (SDMMC_CC2R) Clock Control 2 Register Offset */
#define SDMMC_TUNSR_REG_OFST           (0x224)             /**< (SDMMC_TUNSR) Tuning Status Register Offset */
#define SDMMC_CACR_REG_OFST            (0x230)             /**< (SDMMC_CACR) Capabilities Control Register Offset */
#define SDMMC_DBGR_REG_OFST            (0x234)             /**< (SDMMC_DBGR) Debug Register Offset */
#define SDMMC_VERSION1_REG_OFST        (0x2E8)             /**< (SDMMC_VERSION1) Version Register 1 Offset */
#define SDMMC_VERSION2_REG_OFST        (0x2EC)             /**< (SDMMC_VERSION2) Version Register 2 Offset */
#define SDMMC_VERSION3_REG_OFST        (0x2FC)             /**< (SDMMC_VERSION3) Version Register 3 Offset */

